[
  {
    "topic": "Basics and I/O",
    "level": "Easy",
    "title": "Welcome to C!",
    "description": "Write a C program that prints the message 'Welcome to C Programming!' to the console, followed by a newline.",
    "constraints": "None.",
    "sampleInput": "None",
    "sampleOutput": "Welcome to C Programming!"
  },
  {
    "topic": "Basics and I/O",
    "level": "Easy",
    "title": "Display Your Age",
    "description": "Write a C program that declares an integer variable `age`, assigns your current age to it, and then prints it to the console using a descriptive message. The output should be on a single line.",
    "constraints": "The age will be a positive integer.",
    "sampleInput": "None (age is hardcoded in the program)",
    "sampleOutput": "My age is 30 years."
  },
  {
    "topic": "Basics and I/O",
    "level": "Medium",
    "title": "Sum of Two Numbers",
    "description": "Write a C program that takes two integers as input from the user, calculates their sum, and then prints the sum to the console. The input should be read from separate lines.",
    "constraints": "Input integers will be between -1000 and 1000.",
    "sampleInput": "10\n25",
    "sampleOutput": "The sum is: 35"
  },
  {
    "topic": "Basics and I/O",
    "level": "Medium",
    "title": "Character Display",
    "description": "Write a C program that reads a single character from the user and then prints it along with its ASCII value. The output should clearly label both the character and its ASCII value.",
    "constraints": "Input will be a single printable ASCII character.",
    "sampleInput": "A",
    "sampleOutput": "Character: A, ASCII Value: 65"
  },
  {
    "topic": "Basics and I/O",
    "level": "Hard",
    "title": "Basic Unit Conversion",
    "description": "Write a C program that takes a length in meters (a floating-point number) as input from the user. Convert this length to centimeters and kilometers, and print all three values (original meters, converted centimeters, converted kilometers) formatted to two decimal places.",
    "constraints": "Input will be a positive floating-point number (0.0 < meters <= 100000.0).",
    "sampleInput": "1234.56",
    "sampleOutput": "Length in meters: 1234.56 m\nLength in centimeters: 123456.00 cm\nLength in kilometers: 1.23 km"
  },
  {
    "topic": "Basics and I/O",
    "level": "Hard",
    "title": "Swapping Two Numbers",
    "description": "Write a C program that takes two integer numbers, `a` and `b`, as input from the user. Swap their values (without using a temporary variable) and then print the swapped values to the console. Each value should be printed on a separate line, clearly labeled.",
    "constraints": "Input integers will be between -500 and 500.",
    "sampleInput": "5\n10",
    "sampleOutput": "After swapping:\na = 10\nb = 5"
  },
  {
    "topic": "Basics and I/O",
    "level": "Tricky",
    "title": "Newline Character Trap",
    "description": "Write a C program that first reads an integer, then immediately tries to read a character. Print both the integer and the character. Observe and explain why the character read might not be what you expect if you use `scanf(\"%d\"); scanf(\"%c\");` directly. Provide a solution to correctly read the character.",
    "constraints": "The integer will be between 1 and 100. The character will be any printable ASCII character.",
    "sampleInput": "123\nA",
    "sampleOutput": "Integer: 123\nCharacter: A (after fixing the issue)"
  },
  {
    "topic": "Basics and I/O",
    "level": "Real World Problem",
    "title": "Simple Product Price Calculator",
    "description": "Imagine you're building a simple cash register. Write a C program that takes the price of a single item (a floating-point number) and the quantity purchased (an integer) as input. Calculate the total cost and print it to two decimal places, prefixed with a currency symbol (e.g., '$').",
    "constraints": "Price: 0.01 to 1000.00. Quantity: 1 to 100.",
    "sampleInput": "15.75\n3",
    "sampleOutput": "Total Cost: $47.25"
  }
]
